app/validators/author_email_validator.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
    def validate(record)
      unless User.exists?(email: record.author)