app/controllers/comments_controller.rb

    def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.build(comment_params)
      @comment.author = current_user.email
      if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "author", "created_at", "updated_at", "post_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Save the planet"], ["author", "will.smith@gmail.com"], ["created_at", "2024-10-13 01:26:21.056454"], ["updated_at", "2024-10-13 01:26:21.056454"], ["post_id", 3], ["user_id", nil]]