app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "published", "author", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    @post.author = current_user.email  # Automatically set the author's email

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "posts" SET "published" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["published", 1], ["updated_at", "2024-10-13 00:54:24.343536"], ["id", 12]]
---
  def update
    @post = Post.find_by(id: params[:id])
    if @post.update(post_params)